app/Http/Controllers/FloorsController.php

  public function index(){
  // $floors=datatables(Floor::all())->toJson();
    $floors=Floor::all();
---
select * from `floors`